{
    "id": "ee0e8400-e29b-41d4-a716-446655440000",
    "title": "Berechnung von Determinanten",
    "description": "Lass uns verschiedene Methoden zur Berechnung von Determinanten Schritt für Schritt erkunden.",
    "topic": "Determinanten",
    "steps": [
        {
            "id": "ee0e8400-e29b-41d4-a716-446655440001",
            "text": "Für eine 2×2-Matrix berechnet man die Determinante als Produkt der Hauptdiagonale minus Produkt der Nebendiagonale.",
            "formula": "\\det\\begin{pmatrix} 2 & 3 \\\\ 1 & 4 \\end{pmatrix} = 2 \\cdot 4 - 3 \\cdot 1 = 8 - 3 = 5",
            "explanation": "Bei einer 2×2-Matrix multipliziert man die Elemente der Hauptdiagonale (oben links nach unten rechts) und subtrahiert davon das Produkt der Nebendiagonale (oben rechts nach unten links)."
        },
        {
            "id": "ee0e8400-e29b-41d4-a716-446655440002",
            "text": "Für eine 3×3-Matrix verwendet man die Regel von Sarrus. Man schreibt die ersten beiden Spalten nochmal rechts daneben.",
            "formula": "\\det\\begin{pmatrix} 1 & 2 & 3 \\\\ 4 & 5 & 6 \\\\ 7 & 8 & 9 \\end{pmatrix} = 1 \\cdot 5 \\cdot 9 + 2 \\cdot 6 \\cdot 7 + 3 \\cdot 4 \\cdot 8 - 3 \\cdot 5 \\cdot 7 - 2 \\cdot 4 \\cdot 9 - 1 \\cdot 6 \\cdot 8 = 0",
            "explanation": "Man bildet die Summe der Produkte der Hauptdiagonalen (von links oben nach rechts unten) und subtrahiert davon die Summe der Produkte der Nebendiagonalen (von rechts oben nach links unten)."
        },
        {
            "id": "ee0e8400-e29b-41d4-a716-446655440003",
            "text": "Bei größeren Matrizen verwendet man die Entwicklung nach einer Zeile oder Spalte. Wähle am besten eine Zeile/Spalte mit vielen Nullen.",
            "formula": "\\det\\begin{pmatrix} 1 & 0 & 2 \\\\ 3 & 4 & 0 \\\\ 5 & 6 & 7 \\end{pmatrix} = 1 \\cdot \\det\\begin{pmatrix} 4 & 0 \\\\ 6 & 7 \\end{pmatrix} - 0 \\cdot \\det\\begin{pmatrix} 3 & 0 \\\\ 5 & 7 \\end{pmatrix} + 2 \\cdot \\det\\begin{pmatrix} 3 & 4 \\\\ 5 & 6 \\end{pmatrix}",
            "explanation": "Man entwickelt nach der ersten Zeile. Jedes Element wird mit der Determinante der Matrix multipliziert, die durch Streichen der zugehörigen Zeile und Spalte entsteht. Die Vorzeichen wechseln schachbrettartig."
        },
        {
            "id": "ee0e8400-e29b-41d4-a716-446655440004",
            "text": "Das Gauß-Verfahren ist besonders effizient für größere Matrizen. Man bringt die Matrix in Dreiecksform.",
            "formula": "\\begin{pmatrix} 2 & 1 & 1 \\\\ 1 & 2 & 1 \\\\ 1 & 1 & 2 \\end{pmatrix} \\rightarrow \\begin{pmatrix} 2 & 1 & 1 \\\\ 0 & 1.5 & 0.5 \\\\ 0 & 0 & 1.33 \\end{pmatrix}",
            "explanation": "Durch elementare Zeilenumformungen bringt man die Matrix in Dreiecksform. Die Determinante ist dann das Produkt der Diagonalelemente, multipliziert mit (-1)^k, wobei k die Anzahl der Zeilenvertauschungen ist."
        },
        {
            "id": "ee0e8400-e29b-41d4-a716-446655440005",
            "text": "Bei einer Blockmatrix kann man die Determinante vereinfachen, wenn einer der Blöcke eine Nullmatrix ist.",
            "formula": "\\det\\begin{pmatrix} A & 0 \\\\ C & D \\end{pmatrix} = \\det(A) \\cdot \\det(D)",
            "explanation": "Wenn eine Blockmatrix eine Nullmatrix als Block enthält, kann man die Determinante als Produkt der Determinanten der nicht-null Blöcke berechnen."
        },
        {
            "id": "ee0e8400-e29b-41d4-a716-446655440006",
            "text": "Die Determinante einer Dreiecksmatrix ist einfach das Produkt der Diagonalelemente.",
            "formula": "\\det\\begin{pmatrix} 2 & 1 & 3 \\\\ 0 & 3 & 2 \\\\ 0 & 0 & 4 \\end{pmatrix} = 2 \\cdot 3 \\cdot 4 = 24",
            "explanation": "Bei einer oberen oder unteren Dreiecksmatrix ist die Determinante das Produkt der Elemente auf der Hauptdiagonale. Dies ist besonders nützlich nach Anwendung des Gauß-Verfahrens."
        }
    ]
} 