{    "id": "cc0e8400-e29b-41d4-a716-446655440000",
    "topic": "Lineare Abbildungen",
    "steps": [
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440001",
            "text": "Eine lineare Abbildung f: V → W zwischen Vektorräumen erhält die Vektorraumstruktur. Sie ist additiv und homogen.",
            "formula": "f(\\lambda v + \\mu w) = \\lambda f(v) + \\mu f(w)",
            "explanation": "Diese Eigenschaft bedeutet, dass die Abbildung Geraden auf Geraden abbildet und den Nullpunkt erhält. Stell dir vor, du zeichnest eine Linie im Raum - unter einer linearen Abbildung bleibt sie eine Linie! Das ist wie ein Zaubertrick: Die Struktur bleibt erhalten, nur die Position und Größe können sich ändern."
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440002",
            "text": "Lass uns ein konkretes Beispiel einer linearen Abbildung im ℝ² anschauen: die Rotation um den Ursprung.",
            "formula": "f\\begin{pmatrix} x \\\\ y \\end{pmatrix} = \\begin{pmatrix} \\cos \\theta & -\\sin \\theta \\\\ \\sin \\theta & \\cos \\theta \\end{pmatrix} \\begin{pmatrix} x \\\\ y \\end{pmatrix}",
            "explanation": "Diese Abbildung dreht jeden Vektor um den Winkel θ gegen den Uhrzeigersinn. Sie ist linear, da sie die Vektorraumstruktur erhält und Geraden auf Geraden abbildet. Stell dir vor, du drehst ein Blatt Papier - alle Linien bleiben gerade, nur ihre Richtung ändert sich!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440003",
            "text": "Jede lineare Abbildung f: ℝⁿ → ℝᵐ kann durch eine m×n-Matrix A dargestellt werden. Die Spalten der Matrix sind die Bilder der Standardbasisvektoren.",
            "formula": "f(x) = Ax = \\begin{pmatrix} a_{11} & \\cdots & a_{1n} \\\\ \\vdots & \\ddots & \\vdots \\\\ a_{m1} & \\cdots & a_{mn} \\end{pmatrix} \\begin{pmatrix} x_1 \\\\ \\vdots \\\\ x_n \\end{pmatrix}",
            "explanation": "Die Matrixdarstellung hängt von der gewählten Basis ab. Die Spalten der Matrix zeigen uns, wohin die Basisvektoren abgebildet werden. Das ist wie ein Rezept: Wenn wir wissen, wohin die Grundrichtungen gehen, können wir jeden Vektor transformieren!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440004",
            "text": "Der Kern einer linearen Abbildung ist die Menge aller Vektoren, die auf den Nullvektor abgebildet werden. Er ist ein Untervektorraum.",
            "formula": "\\ker(f) = \\{v \\in V \\mid f(v) = 0\\}",
            "explanation": "Der Kern gibt uns wichtige Informationen über die Abbildung. Seine Dimension heißt Defekt der Abbildung. Ein großer Kern bedeutet, dass viele Vektoren auf den Nullvektor abgebildet werden. Das ist wie ein schwarzes Loch: Alles, was hineinfällt, verschwindet!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440005",
            "text": "Das Bild einer linearen Abbildung ist die Menge aller Bildvektoren. Es ist ebenfalls ein Untervektorraum.",
            "formula": "\\text{im}(f) = \\{f(v) \\mid v \\in V\\}",
            "explanation": "Das Bild zeigt uns, welche Vektoren überhaupt erreicht werden können. Seine Dimension heißt Rang der Abbildung. Ein großes Bild bedeutet, dass viele Vektoren im Zielraum erreicht werden können. Das ist wie ein Schatten: Er zeigt uns, wo wir überall hinkommen können!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440006",
            "text": "Der Dimensionssatz verbindet Kern und Bild einer linearen Abbildung. Er ist eine fundamentale Beziehung.",
            "formula": "\\dim V = \\dim \\ker(f) + \\dim \\text{im}(f)",
            "explanation": "Dieser Satz sagt uns, dass die Summe aus Defekt und Rang gleich der Dimension des Definitionsbereichs ist. Er ist nützlich, um den Rang einer Matrix zu bestimmen. Das ist wie ein Puzzle: Die Teile müssen zusammenpassen!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440007",
            "text": "Eine lineare Abbildung ist injektiv genau dann, wenn ihr Kern nur den Nullvektor enthält.",
            "formula": "f \\text{ injektiv} \\Leftrightarrow \\ker(f) = \\{0\\}",
            "explanation": "Injektive Abbildungen sind umkehrbar auf ihrem Bild. Sie erhalten die lineare Unabhängigkeit von Vektoren. Das bedeutet, dass verschiedene Vektoren auf verschiedene Bilder abgebildet werden. Es ist wie ein Einbahnstraßensystem: Jeder Weg führt zu einem anderen Ziel!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440008",
            "text": "Eine lineare Abbildung ist surjektiv genau dann, wenn ihr Bild der gesamte Zielraum ist.",
            "formula": "f \\text{ surjektiv} \\Leftrightarrow \\text{im}(f) = W",
            "explanation": "Surjektive Abbildungen erreichen jeden Vektor im Zielraum. Das bedeutet, dass für jeden Vektor im Zielraum mindestens ein Urbild existiert. Es ist wie ein Netz: Es fängt jeden Punkt im Zielraum ein!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440009",
            "text": "Eine lineare Abbildung ist bijektiv genau dann, wenn sie injektiv und surjektiv ist.",
            "formula": "f \\text{ bijektiv} \\Leftrightarrow f \\text{ injektiv} \\wedge f \\text{ surjektiv}",
            "explanation": "Bijektive Abbildungen sind umkehrbar. Sie stellen eine eineindeutige Zuordnung zwischen Definitions- und Zielbereich her. Es ist wie ein Tanz: Jeder Partner hat genau einen Tanzpartner!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440010",
            "text": "Die Verkettung linearer Abbildungen ist wieder linear. Die Matrix der Verkettung ist das Produkt der einzelnen Matrizen.",
            "formula": "(g \\circ f)(v) = g(f(v))",
            "explanation": "Die Verkettung entspricht der Matrixmultiplikation. Die Reihenfolge ist wichtig: g∘f bedeutet, dass zuerst f und dann g angewendet wird. Es ist wie eine Verkettung von Zaubertricks: Der Effekt des zweiten Tricks wirkt auf das Ergebnis des ersten!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440011",
            "text": "Eine lineare Abbildung kann durch ihre Wirkung auf eine Basis vollständig beschrieben werden.",
            "formula": "f(v) = f(\\sum_{i=1}^n \\lambda_i b_i) = \\sum_{i=1}^n \\lambda_i f(b_i)",
            "explanation": "Wenn wir wissen, wohin die Basisvektoren abgebildet werden, können wir die Abbildung für jeden Vektor berechnen. Dies ist die Grundlage für die Matrixdarstellung. Es ist wie ein Baukasten: Wenn wir wissen, wohin die Grundbausteine gehen, können wir alles bauen!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440012",
            "text": "Der Rang einer Matrix ist die Dimension des Bildes der zugehörigen linearen Abbildung.",
            "formula": "\\text{rang}(A) = \\dim \\text{im}(f_A)",
            "explanation": "Der Rang gibt uns die maximale Anzahl linear unabhängiger Spalten (oder Zeilen) der Matrix. Er ist wichtig für die Lösbarkeit von linearen Gleichungssystemen. Es ist wie die Anzahl der unabhängigen Richtungen, in die wir uns bewegen können!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440013",
            "text": "Eine lineare Abbildung ist genau dann invertierbar, wenn sie bijektiv ist.",
            "formula": "f^{-1}(f(v)) = v \\text{ und } f(f^{-1}(w)) = w",
            "explanation": "Die inverse Abbildung macht die Wirkung der ursprünglichen Abbildung rückgängig. Ihre Matrix ist die inverse Matrix der ursprünglichen Matrix. Es ist wie ein Rückwärtsgang: Wir können jeden Schritt rückgängig machen!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440014",
            "text": "Die Determinante einer linearen Abbildung gibt das Volumenverhältnis an.",
            "formula": "\\det(f) = \\frac{\\text{Volumen}(f(P))}{\\text{Volumen}(P)}",
            "explanation": "Die Determinante zeigt uns, wie sich Volumina unter der Abbildung ändern. Eine Determinante von 0 bedeutet, dass die Abbildung das Volumen auf 0 zusammenzieht. Es ist wie ein Maßstab: Sie zeigt uns, wie stark die Abbildung dehnt oder staucht!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440015",
            "text": "Eigenwerte und Eigenvektoren einer linearen Abbildung sind besonders wichtig.",
            "formula": "f(v) = \\lambda v",
            "explanation": "Eigenvektoren werden nur gestreckt oder gestaucht, ihre Richtung bleibt erhalten. Die zugehörigen Eigenwerte geben den Streckungsfaktor an. Es ist wie ein Zauberstab: Er verändert nur die Größe, nicht die Richtung!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440016",
            "text": "Lass uns ein konkretes Beispiel einer linearen Abbildung im ℝ³ anschauen: die Projektion auf eine Ebene.",
            "formula": "f\\begin{pmatrix} x \\\\ y \\\\ z \\end{pmatrix} = \\begin{pmatrix} x \\\\ y \\\\ 0 \\end{pmatrix}",
            "explanation": "Diese Abbildung projiziert jeden Vektor auf die xy-Ebene. Sie ist linear, da sie die Vektorraumstruktur erhält. Es ist wie ein Schattenwurf: Jeder Punkt wird senkrecht auf die Ebene projiziert!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440017",
            "text": "Eine weitere wichtige lineare Abbildung ist die Spiegelung an einer Geraden im ℝ².",
            "formula": "f\\begin{pmatrix} x \\\\ y \\end{pmatrix} = \\begin{pmatrix} \\cos 2\\theta & \\sin 2\\theta \\\\ \\sin 2\\theta & -\\cos 2\\theta \\end{pmatrix} \\begin{pmatrix} x \\\\ y \\end{pmatrix}",
            "explanation": "Diese Abbildung spiegelt jeden Vektor an einer Geraden durch den Ursprung mit Winkel θ. Sie ist linear und hat die Determinante -1. Es ist wie ein Spiegel: Jeder Punkt wird auf die andere Seite gespiegelt!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440018",
            "text": "Die Verkettung von Spiegelungen führt zu interessanten Ergebnissen.",
            "formula": "f = f_2 \\circ f_1",
            "explanation": "Die Verkettung zweier Spiegelungen ist eine Rotation. Der Winkel der Rotation ist doppelt so groß wie der Winkel zwischen den Spiegelachsen. Es ist wie ein Doppelspiegel: Zwei Spiegelungen ergeben eine Drehung!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440019",
            "text": "Eine lineare Abbildung kann auch durch ihre Wirkung auf Polynome definiert werden.",
            "formula": "f(p(x)) = p'(x)",
            "explanation": "Die Ableitung ist eine lineare Abbildung auf dem Vektorraum der Polynome. Sie erhält die Vektorraumstruktur und ist linear. Es ist wie ein Transformator: Er verwandelt Polynome in ihre Ableitungen!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440020",
            "text": "Die Matrix einer linearen Abbildung hängt von der gewählten Basis ab.",
            "formula": "A' = P^{-1}AP",
            "explanation": "Wenn wir die Basis ändern, ändert sich auch die Matrix der Abbildung. Die neue Matrix ist ähnlich zur alten. Es ist wie ein Koordinatensystemwechsel: Die Abbildung bleibt gleich, nur ihre Darstellung ändert sich!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440021",
            "text": "Eine lineare Abbildung kann auch durch ihre Wirkung auf Funktionen definiert werden.",
            "formula": "f(g(x)) = \\int_0^x g(t) dt",
            "explanation": "Die Integration ist eine lineare Abbildung auf dem Vektorraum der stetigen Funktionen. Sie erhält die Vektorraumstruktur und ist linear. Es ist wie ein Akkumulator: Er sammelt die Werte der Funktion!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440022",
            "text": "Die Verkettung von Integration und Differentiation ist besonders interessant.",
            "formula": "f(g(x)) = \\frac{d}{dx}\\int_0^x g(t) dt = g(x)",
            "explanation": "Die Verkettung von Integration und Differentiation ergibt die Identität (bis auf eine Konstante). Es ist wie ein Kreis: Wenn wir integrieren und dann ableiten, kommen wir wieder zum Ausgangspunkt!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440023",
            "text": "Eine lineare Abbildung kann auch durch ihre Wirkung auf Matrizen definiert werden.",
            "formula": "f(A) = A^T",
            "explanation": "Die Transposition ist eine lineare Abbildung auf dem Vektorraum der Matrizen. Sie erhält die Vektorraumstruktur und ist linear. Es ist wie ein Spiegel: Sie spiegelt die Matrix an der Hauptdiagonale!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440024",
            "text": "Die Verkettung von Transposition und Matrixmultiplikation führt zu interessanten Ergebnissen.",
            "formula": "(AB)^T = B^T A^T",
            "explanation": "Die Transposition eines Produkts ist das Produkt der transponierten Matrizen in umgekehrter Reihenfolge. Es ist wie ein Handschuhwechsel: Die Reihenfolge der Operationen ist wichtig!"
        },
        {
            "id": "cc0e8400-e29b-41d4-a716-446655440025",
            "text": "Zum Schluss schauen wir uns an, wie lineare Abbildungen in der Computergrafik verwendet werden.",
            "formula": "f\\begin{pmatrix} x \\\\ y \\\\ z \\end{pmatrix} = \\begin{pmatrix} a & b & c \\\\ d & e & f \\\\ g & h & i \\end{pmatrix} \\begin{pmatrix} x \\\\ y \\\\ z \\end{pmatrix}",
            "explanation": "Lineare Abbildungen werden verwendet, um 3D-Objekte zu transformieren. Sie ermöglichen Rotationen, Skalierungen und Spiegelungen. Es ist wie ein Zauberkasten: Mit den richtigen Matrizen können wir jeden 3D-Effekt erzeugen!"
        }
    ]
} 